package ua.edu.chdtu.oop.restaurant;

/**
 * Контракт для будь-яких позицій замовлення, які потребують часу на приготування
 * (наприклад, приготування на кухні або змішування на барі).
 */
public interface Prepareable {

    /**
     * Дає команду розпочати процес приготування.
     */
    void startPreparation();

    /**
     * Перевіряє, чи завершено процес приготування
     * @return true, якщо позиція повністю готова до видачі клієнту, інакше false
     */
    boolean isReady();
    String getStatus();
}